finger563/esp-usb-hid-vcp-example/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# freertos should run at 1 khz instead of the default 100 hz
CONFIG_FREERTOS_HZ=1000

# esp at max clock speed (240 mhz)
# ESP32-specific
#
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# Common ESP-related
#
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192


CONFIG_TINYUSB=y
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_HID_COUNT=1
